Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_autoscaling_attachment.asg_attachment_bar has been deleted
- resource "aws_autoscaling_attachment" "asg_attachment_bar" {
      - alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/8248864adeb13723" -> null
      - autoscaling_group_name = "atlantis_ecs" -> null
      - id                     = "atlantis_ecs-20220318141342396200000001" -> null
    }

  # aws_autoscaling_group.atlantis_ecs has changed
~ resource "aws_autoscaling_group" "atlantis_ecs" {
      ~ availability_zones        = [
          + "us-east-2c",
            # (2 unchanged elements hidden)
        ]
        id                        = "atlantis_ecs"
        name                      = "atlantis_ecs"
        # (22 unchanged attributes hidden)

      - tag {
          - key                 = "Env" -> null
          - propagate_at_launch = false -> null
          - value               = "teste" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lb.lb_ecs has changed
~ resource "aws_lb" "lb_ecs" {
        id                         = "arn:aws:elasticloadbalancing:us-east-2:398963803929:loadbalancer/app/lb-ecs/1ba5a14d83255d1b"
        name                       = "lb-ecs"
        tags                       = {
            "Environment" = "teste"
        }
        # (17 unchanged attributes hidden)


      + subnet_mapping {
          + subnet_id = "subnet-01eb577852a061ca1"
        }
        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment_bar will be created
+ resource "aws_autoscaling_attachment" "asg_attachment_bar" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/8248864adeb13723"
      + autoscaling_group_name = "atlantis_ecs"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.atlantis_ecs will be updated in-place
~ resource "aws_autoscaling_group" "atlantis_ecs" {
        id                        = "atlantis_ecs"
        name                      = "atlantis_ecs"
        # (23 unchanged attributes hidden)

      + tag {
          + key                 = "Env"
          + propagate_at_launch = false
          + value               = "teste"
        }

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_capacity_provider.asg_atlantis will be created
+ resource "aws_ecs_capacity_provider" "asg_atlantis" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "capacity_asg_atlantis"
      + tags_all = (known after apply)

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = "arn:aws:autoscaling:us-east-2:398963803929:autoScalingGroup:350b6cab-ae90-4bae-8db0-92bdc4d20fb3:autoScalingGroupName/atlantis_ecs"
          + managed_termination_protection = (known after apply)

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = (known after apply)
              + minimum_scaling_step_size = (known after apply)
              + status                    = (known after apply)
              + target_capacity           = (known after apply)
            }
        }
    }

  # aws_ecs_cluster.atlantis will be created
+ resource "aws_ecs_cluster" "atlantis" {
      + arn                = (known after apply)
      + capacity_providers = [
          + "capacity_asg_atlantis",
        ]
      + id                 = (known after apply)
      + name               = "atlantis"
      + tags_all           = (known after apply)

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 3 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
